
public class Main {

    // TODO: 15.06.2023 Создать класс УчебнаяГруппа, содержащий в себе поля:
    //  - Преподаватель;
    //  - Список студентов;
    // TODO: 15.06.2023 Создать класс УчебнаяГруппаСервис, в котором реализована:
    //  - функция(Teacher teacher, List<Student> student), которая инициализирует и возвращает УчебнуюГруппу из
    //  Студентов и Преподавателя;
    // TODO: 15.06.2023 Создать Контроллер, который агрегирует функции:
    //  - получения списка студентов;
    //  - получения списка id студентов;
    //  - получения преподавателя;
    //  - получения id преподавателя;
    //  - формирования учебной группы;

    public static void main(String[] args) {

    }

}