
public class Main {

    // + Создать класс УчебнаяГруппа, содержащий в себе поля:
    //  ++ Преподаватель;
    //  ++ Список студентов;
    // + Создать класс УчебнаяГруппаСервис, в котором реализована:
    //  ++ Функция(Teacher teacher, List<Student> student), которая инициализирует и возвращает УчебнуюГруппу из
    //  Студентов и Преподавателя.
    // + Создать Контроллер, который агрегирует функции:
    //  ++ получения списка студентов;
    //  ++ получения списка id студентов;
    //  ++ получения преподавателя;
    //  ++ получения id преподавателя;
    //  ++ формирования учебной группы.

    public static void main(String[] args) {

    }

}