

public class Main {

    public static void main(String[] args) {
//        task01();

    }

    static void task01() {
        /* Задача 1:
        Реализуйте класс Товар, содержащий данные о товаре, и ТорговыйАвтомат,
        содержащий в себе методы initProducts (List <Product>) сохраняющий в
        себе список исходных продуктов и getProduct(String name)
         */
//        VendingMachine vendingMachine = new VendingMachine();
//        vendingMachine.putProduct(new Product("Snickers"));
//        vendingMachine.putProduct(new Product("Mars"));
//        vendingMachine.putProduct(new Product("Bounty"));
//        vendingMachine.putProduct(new Product("Twix"));
//
//        System.out.println(vendingMachine);
//        System.out.println(vendingMachine.getProduct());
//        System.out.println(vendingMachine.getProduct());
//        System.out.println(vendingMachine);
    }

    static void task02() {
        /*
        Задача 2 - Инкапсуляция
        Реализуйте конструкторы, get/set методы, постройте логику ТорговогоАвтомата
        на основе кода сделанного в предыдущем задании.
         */
    }

    static void task03() {
        /*
        Задача 3 - Наследование
        Сделайте класс Товар абстрактным, создайте нескольких наследников (к примеру: БутылкаВоды),
        сделайте интерфейсом ТорговыйАвтомат и реализуйте класс какого-то одного типа ТорговогоАвтомата
        (пример: ПродающийБутылкиВодыАвтомат)
         */
    }
}